package com.zyt.cxfq.common.entity;
/**
 * 保险类型对应 t_skuid枚举类
 * @author Administrator
 *
 */
public enum CommercialFeeEnum {
	
	/**
     * 交强险加车船险
     */
	JQCC("1"),
    /**
     *	机动车损失保险 不计免赔(否)
     */
    JDCSSX0("2"),
	/**
     *	机动车损失保险 不计免赔(是)
     */
    JDCSSX1("3"),
    /**
     *	第三者责任保险 不计免赔(否) 保额30万
     */
    DSFZRX030("4"),
    /**
     *	第三者责任保险 不计免赔(否) 保额50万
     */
    DSFZRX050("5"),
    /**
     *	第三者责任保险 不计免赔(否) 保额100万
     */
    DSFZRX0100("6"),
    /**
     *	第三者责任保险 不计免赔(是) 保额30万
     */
    DSFZRX130("7"),
    /**
     *	第三者责任保险 不计免赔(是) 保额50万
     */
    DSFZRX150("8"),
    /**
     *	第三者责任保险 不计免赔(是) 保额100万
     */
    DSFZRX1100("9"),
    /**
     *	司机座位责任险 不计免赔(是) 保额1万
     */
    SJZWZRX11("10"),
    /**
     *	司机座位责任险 不计免赔(是) 保额2万
     */
    SJZWZRX12("11"),
    /**
     *	司机座位责任险 不计免赔(是) 保额3万
     */
    SJZWZRX13("12"),
    /**
     *	司机座位责任险 不计免赔(否) 保额1万
     */
    SJZWZRX01("13"),
    /**
     *	司机座位责任险 不计免赔(否) 保额2万
     */
    SJZWZRX02("14"),
    /**
     *	司机座位责任险 不计免赔(否) 保额3万
     */
    SJZWZRX03("15"),
    /**
     *	玻璃单独破碎险  国产
     */
    BLDDPSXGC("16"),
    /**
     *	玻璃单独破碎险  进口
     */
    BLDDPSXGK("17"),
    /**
     *	第三者责任保险 不计免赔(否) 保额5万
     */
    DSFZRX05("18"),
    /**
     *	第三者责任保险 不计免赔(是) 保额5万
     */
    DSFZRX15("19"),
    /**
     *	第三者责任保险 不计免赔(否) 保额10万
     */
    DSFZRX010("20"),
    /**
     *	第三者责任保险 不计免赔(是) 保额5万
     */
    DSFZRX110("21"),
    /**
     *	第三者责任保险 不计免赔(否) 保额15万
     */
    DSFZRX015("22"),
    /**
     *	第三者责任保险 不计免赔(是) 保额15万
     */
    DSFZRX115("23"),
    /**
     *	第三者责任保险 不计免赔(否) 保额20万
     */
    DSFZRX020("24"),
    /**
     *	第三者责任保险 不计免赔(是) 保额20万
     */
    DSFZRX120("25"),
    /**
     *	第三者责任保险 不计免赔(否) 保额150万
     */
    DSFZRX0150("26"),
    /**
     *	第三者责任保险 不计免赔(是) 保额150万
     */
    DSFZRX1150("27"),
    /**
     *	第三者责任保险 不计免赔(否) 保额200万
     */
    DSFZRX0200("28"),
    /**
     *	第三者责任保险 不计免赔(是) 保额200万
     */
    DSFZRX1200("29"),
    /**
     *	司机座位责任险 不计免赔(否) 保额4万
     */
    SJZWZZX04("170914fc8153b498f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(是) 保额4万
     */
    SJZWZZX14("170914fc8a28fc98f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(否) 保额5万
     */
    SJZWZZX05("170914fc92939798f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(是) 保额5万
     */
    SJZWZZX15("170914fc99336098f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(否) 保额10万
     */
    SJZWZZX010("170914fc9e1e7b98f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(是) 保额10万
     */
    SJZWZZX110("170914fca2cf3498f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(否) 保额20万
     */
    SJZWZZX020("170914fcaab7c598f511e79ae000ffb99152a4"),
    /**
     *	司机座位责任险 不计免赔(是) 保额20万
     */
    SJZWZZX1020("170914fcb13bd398f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额1万
     */
    CKZWX01("170914fcb79cc298f511e79ae000ffb99152a4"),
    /**
    *	乘客座位责任险  不计免赔(是) 保额1万
    */
    CKZWX11("170914fcbf14ce98f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额2万
     */
    CKZWX02("170914fcc5b24398f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额2万
     */
    CKZWX12("170914fce1776498f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额3万
     */
    CKZWX03("170914fceaa59998f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额3万
     */
    CKZWX13("170914fcf2e77498f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额4万
     */
    CKZWX04("170914fcf9c61b98f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额4万
     */
    CKZWX14("170914fd067b4098f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额5万
     */
    CKZWX05("170914fd0ec52498f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额5万
     */
    CKZWX15("170914fd1663d598f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额10万
     */
    CKZWX010("170914fd1cfc3298f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额10万
     */
    CKZWX110("170914fd246f9398f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(否) 保额20万
     */
    CKZWX020("170914fd2be83598f511e79ae000ffb99152a4"),
    /**
     *	乘客座位责任险  不计免赔(是) 保额20万
     */
    CKZWX120("170914fd34f7ac98f511e79ae000ffb99152a4"),
    /**
     *	全车盗抢险  不计免赔(否) 
     */
    QCDQX0("170914fd3b4c0198f511e79ae000ffb99152a4"),
    /**
     *	全车盗抢险  不计免赔(是) 
     */
    QCDQX1("170914fd3f80fc98f511e79ae000ffb99152a4"),
    /**
     *	自燃损失险  不计免赔(否) 
     */
    ZRSSX0("170914fd43408c98f511e79ae000ffb99152a4"),
    /**
     *	自燃损失险  不计免赔(是) 
     */
    ZRSSX1("170914fd479d7a98f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(否) 保额2000
     */
    CSHHSSX02K("170914fd50debc98f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(是) 保额2000
     */
    CSHHSSX12K("170914fd57010498f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(否) 保额5000
     */
    CSHHSSX05K("170914fd5cc8c598f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(是) 保额5000
     */
    CSHHSSX15K("170914fd62d43798f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(否) 保额1万
     */
    CSHHSSX01("170914fd6770e498f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(是) 保额1万
     */
    CSHHSSX11("170914fd6be87698f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(否) 保额2万
     */
    CSHHSSX02("170914fd707e7498f511e79ae000ffb99152a4"),
    /**
     *	车身划痕损失险  不计免赔(是) 保额2万
     */
    CSHHSSX12("170914fd77351198f511e79ae000ffb99152a4"),
    /**
     *	新增设备损失险  不计免赔(否) 
     */
    XZSBSSX0("170914fd85d5dc98f511e79ae000ffb99152a4"),
    /**
     *	新增设备损失险  不计免赔(是) 
     */
    XZSBSSX1("170914fd8981ac98f511e79ae000ffb99152a4"),
    /**
     *	发动机涉水损失险  不计免赔(否) 
     */
    FDJSSSSX0("170914fd8c2db998f511e79ae000ffb99152a4"),
    /**
     *	发动机涉水损失险  不计免赔(是) 
     */
    FDJSSSSX1("170914fd8f57e698f511e79ae000ffb99152a4"),
    /**
     *	车上货物责任险  不计免赔(否) 
     */
    CSHWSSX0("170914fd96476398f511e79ae000ffb99152a4"),
    /**
     *	车上货物责任险  不计免赔(是) 
     */
    CSHWSSX1("170914fd9a824b98f511e79ae000ffb99152a4"),
    /**
     *	精神损害抚慰金责任险 不计免赔(否) 
     */
    JSSHFWJZZX0("170914fd9e8eaa98f511e79ae000ffb99152a4"),
    /**
     *	精神损害抚慰金责任险 不计免赔(是) 
     */
    JSSHFWJZZX1("170914fda2727798f511e79ae000ffb99152a4"),
    /**
     *	修理期间费用补偿险
     */
    WXQJFYBCX("170914fd92ee4898f511e79ae000ffb99152a4"),
    /**
     *	机动车损失保险无法找到第三方特约险
     */
    JDCSSBXWFZDDSF("170914fda7718c98f511e79ae000ffb99152a4"),
    /**
     *	指定修理厂险
     */
    ZDXLCX("170914fdabed9898f511e79ae000ffb99152a4");
	
	
	
	private String code;//状态值  
    
    private CommercialFeeEnum(String code){  
        this.code = code;  
    }  
  
    public String getSkuid() {  
        return code;  
    }  
}
